/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <fngoc@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/03 12:00:09 by fngoc             #+#    #+#             */
/*   Updated: 2021/02/02 13:01:44 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libftprintf.h"

/*
** ft_putchar_fd: Выводит символ 'c'
** в указанный файл дескриптор, так же
** подсчитывает количество напечатаных
** символов.
*/

void	ft_putchar_fd(char c, int fd, t_parser *p)
{
	write(fd, &c, 1);
	p->count++;
}
