/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd_mod.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <fngoc@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/03 12:00:05 by fngoc             #+#    #+#             */
/*   Updated: 2021/02/02 13:01:40 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libftprintf.h"

/*
** ft_putchar_fd_mod: Выводит символ 'c'
** в указанный файл дескриптор, coll раз.
*/

void	ft_putchar_fd_mod(char c, int fd, int coll, t_parser *p)
{
	while (coll-- != 0)
		ft_putchar_fd(c, fd, p);
}
